# 2. Refine the Data
 
> "Data is messy"

- **Missing** e.g. Check for missing or incomplete data
- **Quality** e.g. Check for duplicates, accuracy, unusual data
- **Parse** e.g. extract year and month from date
- **Convert** e.g. free text to coded value
- **Derive** e.g. gender from title
- **Calculate** e.g. percentages, proportion
- **Remove** e.g. remove redundant data
- **Merge** e.g. first and surname for full name
- **Aggregate** e.g. rollup by year, cluster by area
- **Filter** e.g. exclude based on location
- **Sample** e.g. extract a representative data
- **Summary** e.g. show summary stats like mean

In [1]:
# Load the libraries
import numpy as np
import pandas as pd

In [2]:
# Load the data again!
df = pd.read_csv("data/Weed_Price.csv", parse_dates=[-1])

## 2.1 Missing Data

By “missing” data we simply mean null or “not present for whatever reason”. Lets see if we can find the missing data in our data set either because it exists and was not collected or it never existed

In [3]:
# Lets start the count to seeing about missing data
df.count()

State     22899
HighQ     22899
HighQN    22899
MedQ      22899
MedQN     22899
LowQ      12342
LowQN     22899
date      22899
dtype: int64

In [4]:
df['LowQ'].isnull()

0        False
1        False
2        False
3        False
4        False
5        False
6        False
7        False
8        False
9        False
10       False
11       False
12       False
13       False
14       False
15       False
16       False
17       False
18       False
19       False
20       False
21       False
22       False
23       False
24       False
25       False
26       False
27       False
28       False
29       False
         ...
22869     True
22870     True
22871     True
22872     True
22873     True
22874     True
22875     True
22876     True
22877     True
22878     True
22879     True
22880     True
22881     True
22882     True
22883     True
22884     True
22885     True
22886     True
22887     True
22888     True
22889     True
22890     True
22891     True
22892     True
22893     True
22894     True
22895     True
22896     True
22897     True
22898     True
Name: LowQ, dtype: bool

In [5]:
# We can see the bottom rows which have NaN values
df.tail()

               State   HighQ  HighQN    MedQ  MedQN  LowQ  LowQN       date
22894       Virginia  364.98    3513  293.12   3079   NaN    284 2014-12-31
22895     Washington  233.05    3337  189.92   3562   NaN    160 2014-12-31
22896  West Virginia  359.35     551  224.03    545   NaN     60 2014-12-31
22897      Wisconsin  350.52    2244  272.71   2221   NaN    167 2014-12-31
22898        Wyoming  322.27     131  351.86    197   NaN     12 2014-12-31

**Pandas will represent missing value by NaN**

What can we do this with missing value?
- Drop these rows / columns? Use `.dropna(how='any')`
- Fill with a dummy value? Use `.fillna(value=dummy)`
- Impute the cell with the most recent value? Use `.fillna(method='ffill')`
- Interpolate the amount in a linear fashion? Use `.interpolate()`

We use the `inplace = True` operator to avoid making a copy of the dataframe and changing the dataframe itself

In [6]:
# Lets sort this data frame by State and Date
df.sort(columns=['State','date'], inplace=True)

In [7]:
# Lets fill the missing value with last available value
df.fillna(method = "ffill", inplace=True)

In [8]:
df.count()

State     22899
HighQ     22899
HighQN    22899
MedQ      22899
MedQN     22899
LowQ      22899
LowQN     22899
date      22899
dtype: int64

### Exercise

Fill the missing value with a backward fill.

Fill the missing values with the mean for the column.

## 2.2 Quality of the Data 

Lets check for completeness.

**Say, do we have data on each date for all the 51 states?**

In [9]:
df["State"].value_counts()

Utah                    449
Washington              449
Massachusetts           449
Missouri                449
Connecticut             449
Vermont                 449
Pennsylvania            449
Georgia                 449
California              449
North Carolina          449
Florida                 449
Oregon                  449
Alabama                 449
Indiana                 449
Kentucky                449
Hawaii                  449
South Carolina          449
Virginia                449
Oklahoma                449
Texas                   449
Illinois                449
Nebraska                449
Ohio                    449
Arizona                 449
Rhode Island            449
Louisiana               449
Wisconsin               449
New York                449
Arkansas                449
Montana                 449
New Hampshire           449
North Dakota            449
New Mexico              449
Delaware                449
Iowa                    449
New Jersey              449
Kansas                  449
Idaho                   449
Colorado                449
Maryland                449
District of Columbia    449
Michigan                449
South Dakota            449
West Virginia           449
Minnesota               449
Wyoming                 449
Mississippi             449
Tennessee               449
Nevada                  449
Maine                   449
Alaska                  449
dtype: int64

**Lets check the dates and see if they are all continuous**

## 2.3  Parse the Data

Lets see if we can get the year, month, week and weekdays from the date. Pandas has got good built in functionality for timeseries data using the DatetimeIndex method

In [10]:
df['year'] = pd.DatetimeIndex(df['date']).year
df['month'] = pd.DatetimeIndex(df['date']).month
df['week'] = pd.DatetimeIndex(df['date']).week
df['weekday'] = pd.DatetimeIndex(df['date']).weekday

In [11]:
df.dtypes

State              object
HighQ             float64
HighQN              int64
MedQ              float64
MedQN               int64
LowQ              float64
LowQN               int64
date       datetime64[ns]
year                int32
month               int32
week                int32
weekday             int32
dtype: object

In [12]:
df.tail()

,State,HighQ,HighQN,MedQ,MedQN,LowQ,LowQN,date,year,month,week,weekday
4997,Wyoming,313.72,148,317.38,226,161.3,13,2015-06-07,2015,6,23,6
5762,Wyoming,313.72,148,317.38,226,161.3,13,2015-06-08,2015,6,24,0
6527,Wyoming,313.72,148,317.38,226,161.3,13,2015-06-09,2015,6,24,1
7343,Wyoming,313.72,148,317.38,226,161.3,13,2015-06-10,2015,6,24,2
8159,Wyoming,313.72,148,317.38,226,161.3,13,2015-06-11,2015,6,24,3

In [13]:
df['year'].value_counts()

2014    18564
2015     4080
2013      255
dtype: int64

In [14]:
df['month'].value_counts()

1     3162
5     2703
2     2244
6     2091
12    1836
10    1581
7     1581
3     1581
11    1530
9     1530
8     1530
4     1530
dtype: int64

In [15]:
df["weekday"].value_counts()

6    3315
0    3315
4    3264
3    3264
2    3264
1    3264
5    3213
dtype: int64

## 2.4 Aggregate the Data

To aggregate, we typically use the “group by” function, which involves the following steps

- Splitting the data into groups based on some criteria
- Applying a function to each group independently
- Combining the results into a data structure

In [16]:
df_mean = df.groupby("State", as_index=False).mean()

In [17]:
df_mean.shape

(51, 11)

In [18]:
df_mean.head()

,State,HighQ,HighQN,MedQ,MedQN,LowQ,LowQN,year,month,week,weekday
0,Alabama,339.561849,1379.414254,204.606169,1270.351893,145.978508,161.149220,2014.167038,5.953229,23.812918,2.995546
1,Alaska,291.482004,321.244989,262.046392,407.917595,394.653964,32.334076,2014.167038,5.953229,23.812918,2.995546
2,Arizona,300.667483,2392.465479,209.365345,2137.414254,188.500134,279.006682,2014.167038,5.953229,23.812918,2.995546
3,Arkansas,348.056147,751.988864,190.414655,724.683742,126.771269,135.902004,2014.167038,5.953229,23.812918,2.995546
4,California,245.376125,14947.073497,191.268909,16769.821826,189.783586,976.298441,2014.167038,5.953229,23.812918,2.995546

Add Pivot table examples and exercise

## 2.5 Derive the Data

Lets us load the demographic dataset and create a new column for others in the population

In [19]:
df_demo = pd.read_csv("data/Demographics_State.csv")

In [20]:
df_demo.head()

,region,total_population,percent_white,percent_black,percent_asian,percent_hispanic,per_capita_income,median_rent,median_age
0,alabama,4799277,67,26,1,4,23680,501,38.1
1,alaska,720316,63,3,5,6,32651,978,33.6
2,arizona,6479703,57,4,3,30,25358,747,36.3
3,arkansas,2933369,74,15,1,7,22170,480,37.5
4,california,37659181,40,6,13,38,29527,1119,35.4

In [21]:
df_demo["percent_other"] = 100 - df_demo["percent_white"] - df_demo["percent_black"] - df_demo["percent_asian"] - df_demo["percent_hispanic"]

In [22]:
df_demo.head()

,region,total_population,percent_white,percent_black,percent_asian,percent_hispanic,per_capita_income,median_rent,median_age,percent_other
0,alabama,4799277,67,26,1,4,23680,501,38.1,2
1,alaska,720316,63,3,5,6,32651,978,33.6,23
2,arizona,6479703,57,4,3,30,25358,747,36.3,6
3,arkansas,2933369,74,15,1,7,22170,480,37.5,3
4,california,37659181,40,6,13,38,29527,1119,35.4,3

Add an exercise?

## 2.6 Merge the Data 

Lets merge the demographic dataset with the price dataset

In [23]:
# Let us change the column name region to State
df_demo = df_demo.rename(columns={'region':'State'})

In [24]:
df_demo.head()

,State,total_population,percent_white,percent_black,percent_asian,percent_hispanic,per_capita_income,median_rent,median_age,percent_other
0,alabama,4799277,67,26,1,4,23680,501,38.1,2
1,alaska,720316,63,3,5,6,32651,978,33.6,23
2,arizona,6479703,57,4,3,30,25358,747,36.3,6
3,arkansas,2933369,74,15,1,7,22170,480,37.5,3
4,california,37659181,40,6,13,38,29527,1119,35.4,3

In [26]:
# We can now merge Demographic and Price mean data into one single data frame
df_merge = pd.merge(df_mean, df_demo, how='inner', on='State')
df_merge.head()

Empty DataFrame
Columns: [State, HighQ, HighQN, MedQ, MedQN, LowQ, LowQN, year, month, week, weekday, total_population, percent_white, percent_black, percent_asian, percent_hispanic, per_capita_income, median_rent, median_age, percent_other]
Index: []

What happened? Why is there no data in the dataframe?

In [27]:
# Change the State in df_mean to lower case
df_mean['State'] = df_mean['State'].str.lower()

In [28]:
df_mean.head()

,State,HighQ,HighQN,MedQ,MedQN,LowQ,LowQN,year,month,week,weekday
0,alabama,339.561849,1379.414254,204.606169,1270.351893,145.978508,161.149220,2014.167038,5.953229,23.812918,2.995546
1,alaska,291.482004,321.244989,262.046392,407.917595,394.653964,32.334076,2014.167038,5.953229,23.812918,2.995546
2,arizona,300.667483,2392.465479,209.365345,2137.414254,188.500134,279.006682,2014.167038,5.953229,23.812918,2.995546
3,arkansas,348.056147,751.988864,190.414655,724.683742,126.771269,135.902004,2014.167038,5.953229,23.812918,2.995546
4,california,245.376125,14947.073497,191.268909,16769.821826,189.783586,976.298441,2014.167038,5.953229,23.812918,2.995546

In [29]:
# We can now merge Demographic and Price mean data into one single data frame
df_merge = pd.merge(df_mean, df_demo, how='inner', on='State')

In [30]:
df_merge.head()

,State,HighQ,HighQN,MedQ,MedQN,LowQ,LowQN,year,month,week,weekday,total_population,percent_white,percent_black,percent_asian,percent_hispanic,per_capita_income,median_rent,median_age,percent_other
0,alabama,339.561849,1379.414254,204.606169,1270.351893,145.978508,161.149220,2014.167038,5.953229,23.812918,2.995546,4799277,67,26,1,4,23680,501,38.1,2
1,alaska,291.482004,321.244989,262.046392,407.917595,394.653964,32.334076,2014.167038,5.953229,23.812918,2.995546,720316,63,3,5,6,32651,978,33.6,23
2,arizona,300.667483,2392.465479,209.365345,2137.414254,188.500134,279.006682,2014.167038,5.953229,23.812918,2.995546,6479703,57,4,3,30,25358,747,36.3,6
3,arkansas,348.056147,751.988864,190.414655,724.683742,126.771269,135.902004,2014.167038,5.953229,23.812918,2.995546,2933369,74,15,1,7,22170,480,37.5,3
4,california,245.376125,14947.073497,191.268909,16769.821826,189.783586,976.298441,2014.167038,5.953229,23.812918,2.995546,37659181,40,6,13,38,29527,1119,35.4,3

## 2.7 Filter the Data

Lets start by filtering the data 
- by location
- by Year
- by location & Year

In [31]:
# Filter data for location California
df_cal = df[df["State"] == "California"]

In [32]:
df_cal.shape

(449, 12)

In [33]:
# Filter data for year
df_2014 = df[df["year"] == 2014]

In [34]:
df_2014.shape

(18564, 12)

In [35]:
df_cal_2014 = df[(df["year"] == 2014) & (df["State"] == "California")]

In [36]:
df_cal_2014.shape

(364, 12)

In [37]:
df_cal_2014.head()

,State,HighQ,HighQN,MedQ,MedQN,LowQ,LowQN,date,year,month,week,weekday
4,California,248.78,12096,193.56,12812,192.92,778,2014-01-01,2014,1,1,2
769,California,248.67,12125,193.56,12836,192.80,779,2014-01-02,2014,1,1,3
1483,California,248.67,12141,193.57,12853,192.67,782,2014-01-03,2014,1,1,4
2248,California,248.65,12155,193.59,12884,192.67,782,2014-01-04,2014,1,1,5
3013,California,248.68,12176,193.63,12902,192.67,782,2014-01-05,2014,1,1,6

Exercise to get simple metrics???

## 2.8 Summarise the Data

We can use the describe function to get the summary stats for each column in the data frame

In [38]:
df.describe()

,HighQ,HighQN,MedQ,MedQN,LowQ,LowQN,year,month,week,weekday
count,22899.000000,22899.000000,22899.000000,22899.000000,22899.000000,22899.000000,22899.000000,22899.000000,22899.000000,22899.000000
mean,329.759854,2274.743657,247.618306,2183.737805,203.624092,202.804489,2014.167038,5.953229,23.812918,2.995546
std,41.173167,2641.936586,44.276015,2789.902626,101.484265,220.531987,0.401765,3.553055,15.426018,2.005599
min,202.020000,93.000000,144.850000,134.000000,63.700000,11.000000,2013.000000,1.000000,1.000000,0.000000
25%,303.780000,597.000000,215.775000,548.000000,145.810000,51.000000,2014.000000,3.000000,9.000000,1.000000
50%,342.310000,1420.000000,245.800000,1320.000000,185.780000,139.000000,2014.000000,6.000000,22.000000,3.000000
75%,356.550000,2958.000000,274.155000,2673.000000,222.940000,263.000000,2014.000000,9.000000,37.000000,5.000000
max,415.700000,18492.000000,379.000000,22027.000000,734.650000,1287.000000,2015.000000,12.000000,52.000000,6.000000

We can also use convenience functions like sum(), count(), mean() etc. to calculate these

In [39]:
df.HighQ.mean()

329.75985414210226

In [40]:
# Lets do this the hard way
df.HighQ.sum()

7551170.8999999994

In [41]:
df.HighQ.count()

22899

In [42]:
df.HighQ.sum()/df.HighQ.count()

329.75985414210226

In [43]:
df.HighQ.median()

342.31

Add more exercises???

## 2.9 Sample the Data

In [46]:
?df.sample

In [51]:
df_ca_sample = df[df.State=='California'].sample(n = 50, replace = True, random_state=123)

In [57]:
df_ca_sample.duplicated()

20914    False
10051    False
11428    False
2503     False
11275    False
9235     False
14590    False
8725     False
21118    False
15967    False
21322    False
7399     False
1024     False
13927    False
1075     False
8572     False
7042     False
20200    False
17599    False
6583     False
12499    False
6991     False
1432     False
20047    False
5104     False
10357    False
1024      True
16987    False
3217     False
21475    False
2911     False
21577    False
2197     False
2350     False
11428     True
15304    False
8572      True
5716     False
15508    False
7960     False
17956    False
3268     False
8521     False
8419     False
18364    False
15814    False
12244    False
20608    False
17497    False
9949     False
dtype: bool

In [58]:
df_ca_sample.loc[8572]

,State,HighQ,HighQN,MedQ,MedQN,LowQ,LowQN,date,year,month,week,weekday
8572,California,248.26,12753,192.89,13618,191,818,2014-02-12,2014,2,7,2
8572,California,248.26,12753,192.89,13618,191,818,2014-02-12,2014,2,7,2

## 2.10 Quirks in Pandas

In [69]:
df_ca_sample.iat[0, 0] = "Cal"

In [71]:
df_ca_sample.head()

,State,HighQ,HighQN,MedQ,MedQN,LowQ,LowQN,date,year,month,week,weekday
20914,Cal,244.05,16474,189.42,19085,188.60,1093,2014-12-28,2014,12,52,6
10051,California,243.60,16664,189.19,19416,188.60,1109,2015-01-14,2015,1,3,2
11428,California,244.75,15893,190.43,18113,188.60,1042,2014-11-15,2014,11,46,5
2503,California,246.53,13435,192.83,14590,191.62,866,2014-04-04,2014,4,14,4
11275,California,245.27,15108,191.60,16881,187.94,989,2014-08-15,2014,8,33,4

But changes when you copy

In [74]:
df_ca_sample2 = df_ca_sample

In [77]:
df_ca_sample2.iat[0, 0] = "CA"
df_ca_sample2.head()

,State,HighQ,HighQN,MedQ,MedQN,LowQ,LowQN,date,year,month,week,weekday
20914,CA,244.05,16474,189.42,19085,188.60,1093,2014-12-28,2014,12,52,6
10051,California,243.60,16664,189.19,19416,188.60,1109,2015-01-14,2015,1,3,2
11428,California,244.75,15893,190.43,18113,188.60,1042,2014-11-15,2014,11,46,5
2503,California,246.53,13435,192.83,14590,191.62,866,2014-04-04,2014,4,14,4
11275,California,245.27,15108,191.60,16881,187.94,989,2014-08-15,2014,8,33,4

In [78]:
df_ca_sample.head()

,State,HighQ,HighQN,MedQ,MedQN,LowQ,LowQN,date,year,month,week,weekday
20914,CA,244.05,16474,189.42,19085,188.60,1093,2014-12-28,2014,12,52,6
10051,California,243.60,16664,189.19,19416,188.60,1109,2015-01-14,2015,1,3,2
11428,California,244.75,15893,190.43,18113,188.60,1042,2014-11-15,2014,11,46,5
2503,California,246.53,13435,192.83,14590,191.62,866,2014-04-04,2014,4,14,4
11275,California,245.27,15108,191.60,16881,187.94,989,2014-08-15,2014,8,33,4

Fix the issue

In [79]:
df_ca_sample3 = df_ca_sample2.copy()

In [80]:
df_ca_sample3.head()

,State,HighQ,HighQN,MedQ,MedQN,LowQ,LowQN,date,year,month,week,weekday
20914,CA,244.05,16474,189.42,19085,188.60,1093,2014-12-28,2014,12,52,6
10051,California,243.60,16664,189.19,19416,188.60,1109,2015-01-14,2015,1,3,2
11428,California,244.75,15893,190.43,18113,188.60,1042,2014-11-15,2014,11,46,5
2503,California,246.53,13435,192.83,14590,191.62,866,2014-04-04,2014,4,14,4
11275,California,245.27,15108,191.60,16881,187.94,989,2014-08-15,2014,8,33,4

In [81]:
df_ca_sample3.iat[0, 0] = "CALIFORNIA"
df_ca_sample3.head()

,State,HighQ,HighQN,MedQ,MedQN,LowQ,LowQN,date,year,month,week,weekday
20914,CALIFORNIA,244.05,16474,189.42,19085,188.60,1093,2014-12-28,2014,12,52,6
10051,California,243.60,16664,189.19,19416,188.60,1109,2015-01-14,2015,1,3,2
11428,California,244.75,15893,190.43,18113,188.60,1042,2014-11-15,2014,11,46,5
2503,California,246.53,13435,192.83,14590,191.62,866,2014-04-04,2014,4,14,4
11275,California,245.27,15108,191.60,16881,187.94,989,2014-08-15,2014,8,33,4

In [82]:
df_ca_sample2.head()

,State,HighQ,HighQN,MedQ,MedQN,LowQ,LowQN,date,year,month,week,weekday
20914,CA,244.05,16474,189.42,19085,188.60,1093,2014-12-28,2014,12,52,6
10051,California,243.60,16664,189.19,19416,188.60,1109,2015-01-14,2015,1,3,2
11428,California,244.75,15893,190.43,18113,188.60,1042,2014-11-15,2014,11,46,5
2503,California,246.53,13435,192.83,14590,191.62,866,2014-04-04,2014,4,14,4
11275,California,245.27,15108,191.60,16881,187.94,989,2014-08-15,2014,8,33,4